benchmark/old_outputs/single_thread/sieve_new/uni_16/2026-04-17T20:11:10-04:00_1_1_1.5.txt
pgbench (19devel)
transaction type: multiple scripts
scaling factor: 1000
query mode: simple
number of clients: 2
number of threads: 1
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 1576588
number of failed transactions: 0 (0.000%)
latency average = 0.228 ms
initial connection time = 2.525 ms
tps = 8758.936916 (without initial connection time)
SQL script 1: pgscripts/uniform_select.sql
 - weight: 1 (targets 50.0% of total)
 - 787903 transactions (50.0% of total)
 - number of transactions actually processed: 787903 (tps = 4377.296207)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.096 ms
 - latency stddev = 0.022 ms
SQL script 2: pgscripts/uniform_update.sql
 - weight: 1 (targets 50.0% of total)
 - 788685 transactions (50.0% of total)
 - number of transactions actually processed: 788685 (tps = 4381.640708)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.359 ms
 - latency stddev = 0.584 ms
ratio: .6645344652880999